Repository: Acidburn0zzz/flatpak-docs
Catalog: po/*/LC_MESSAGES/building-simple-apps.po
Languages: es

source: Building Simple Apps
es: Construcción de apps simples

source: The ``flatpak`` utility provides a simple set of commands for building and distributing applications. These allow creating new Flatpaks, into which new or existing applications can be built.
es: La utilidad ``flatpak`` proporciona un conjunto simple de comandos para construir y distribuir aplicaciones. Estos permiten crear nuevos Flatpaks, en los que se pueden construir aplicaciones nuevas o existentes.

source: This section describes how to build a simple application which doesn't require any additional dependencies outside of the runtime it is built against. In order to complete the examples, you should have completed the steps in `Getting Setup <getting-setup.html>`_ first.
es: Esta sección describe cómo construir una aplicación simple que no requiere ninguna dependencia adicional fuera del runtime contra el que es construida. Para poder completar los ejemplos, debería haber completado antes los pasos de la `Preparación <getting-setup.html>`_.

source: Creating an app
es: Creación de una app

source: To create an application, the first step is to use the ``build-init`` command. This creates a directory into which an application can be built, which contains the correct directory structure and a metadata file which contains information about the app. The format for build-init is::
es: Para crear una aplicación, el primer paso es usar el comando ``build-init``. Esto crea un directorio en el cual la aplicación puede ser construida, con la estructura de directorios correcta y el archivo de metadatos que contiene información sobre la app. El formato de build-init es::

source: DIRECTORY is the name of the directory that will be created to contain the application
es: DIRECTORIO es el nombre del directorio que será creado para contener a la aplicación

source: APPNAME is the D-Bus name of the application
es: NOMBREAPP es el nombre de D-Bus de la aplicación

source: SDK is the name of the SDK that will be used to build the application
es: SDK es el nombre del SDK que será usado para construir la aplicación

source: RUNTIME is the name of the runtime that will be required by the application
es: RUNTIME es el nombre del runtime runtime que será requerido por la aplicaación

source: BRANCH is typically the version of the SDK and runtime that will be used
es: RAMA es típicamente la versión del SDK y del runtime que será usada

source: For example, to build the GNOME Dictionary application using the GNOME 3.22 SDK, the command would look like::
es: Por ejemplo, para construir la aplicación Diccionario de GNOME usando el SDK de GNOME 3.22, el comando se vería así::

source: You can try this command now. In the next step we will build an application inside the resulting dictionary directory.
es: Puede probar este comando ahora mismo. En el próximo paso construiremos una aplicación dentro del directorio dictionary creado.

source: Building
es: Construcción

source: ``flatpak build`` is used to build an application using an SDK. This command is used to provide access to a sandbox. For example, the following will create a file inside the appdir sandbox (in the files directory)::
es: ``flatpak build`` se usa para construir una aplicación usando un SDK. Este comando se usa para proporcionar acceso al sandbox. Por ejemplo, el siguiente comando creará un archivo dentro del directorio /app del sandbox, en el directorio files::

source: (It is best to remove this file before continuing.)
es: Se recomienda eliminar el archivo antes de continuar.

source: The build command allows existing applications that have been made using the traditional configure, make, make install routine to be built inside a flatpak. You can try this using GNOME Dictionary. First, download the source files, extract them and switch to the resulting directory::
es: El comando build permite que las aplicaciones existentes que hayan sido hechas con la tradicional rutina configure, make, make install sean construidas dentro de flatpak. Puede probar esto usando el Diccionario de GNOME. Primero, descargue los archivos fuente, extráigalos y posiciónese dentro del directorio creado::

source: Then you can use the build command to build and install the source inside the dictionary directory that was previously made::
es: Luego puede usar el comando build para construir e instalar el código fuente dentro del directorio dictionary que fue creado anteriormente::

source: Since these are run in a sandbox, the compiler and other tools from the SDK are used to build and install, rather than those on the host system.
es: Dado que esto corre en el sandbox, el compilador y otras herramientas del SDK son usadas para construir e instalar, en vez de usarse las del sistema host.

source: Completing the build
es: Completar la construcción

source: Once an application has been built, the ``build-finish`` command needs to be used to specify access to different parts of the host, such as networking and graphics sockets. This command is also used to specify the command that is used to run the app (done by modifying the metadata file), and to create the application's exports directory. For example::
es: Una vez que la aplicación fue construida, necesita correr el comando ``build-finish`` para especificar el acceso a las distintas partes del host, tales como la red y los sockets de gráficos. Este comando también es usado para especificar el comando que será llamado para lanzar la app (esto se hace modificando el archivo metadata), y para crear el directorio de exportación de la aplicación. Por ejemplo::

source: At this point you have successfully built a flatpak and prepared it to be run. To test the app, you need to export the Dictionary to a repository, add that repository and then install and run the app::
es: En este punto ya se ha construido exitosamente un flatpak listo para ser lanzado. Para probar el app, necesita exportar el Diccionario a un repositorio. Agregue ese repositorio y luego instale y corra la app::

source: This exports the app, creates a repository called tutorial-repo, installs the Dictionary application in the per-user installation area and runs it.
es: Esto exporta la app, crea un repositorio llamado tutorial-repo, instala la aplicación Diccionario para este solo usuario, y finalmente lanza la aplicación.
