Repository: Acidburn0zzz/flatpak-docs
Catalog: po/*/LC_MESSAGES/distributing-applications.po
Languages: es

source: Distributing Applications
es: Distribución de aplicaciones

source: Flatpak provides several ways to distribute applications. The primary method is to host a repository. This is relatively simple (although there are some important details to be aware of) and allows application updates to be distributed.
es: Flatpak proporciona varias formas de distribuir aplicaciones. El método principal es alojando un repositorio. Esto es relativamente simple, aunque hay algunos detalles importantes a tener en cuenta, y permite que se distribuyan actualizaciones de las aplicaciones.

source: It is also possible to distribute Flatpaks as single file bundles, which can be useful in some situations.
es: También es posible distribuir Flatpaks como un solo archivo autocontenido, lo que puede ser útil en algunas situaciones.

source: Hosting a repository
es: Hospedar un repositorio

source: The previous sections of this guide describe how to generate repositories using ``build-export`` or ``flatpak-builder``. The resulting OSTree repository can be hosted on a web server for consumption by users.
es: Las secciones anteriores de esta guía describen cómo generar repositorios usando ``build-export`` o ``flatpak-builder``. El repositorio OSTree resultante puede ser hospedado en un servidor web para consumo de los usuarios.

source: Important details
es: Detalles importantes

source: OSTree repositories use archive-z2, meaning that they contain a single file for each file in the application. This means that pull operations will do a lot of HTTP requests. Since new requests are slow, it is important to enable HTTP keep-alive on the web server.
es: Los repositorios OSTree usan archive-z2, lo que significa que contienen un solo archivo por cada archivo de la aplicación. Esto implica que las operaciones *pull* harán una gran cantidad de peticiones HTTP. Dado que las nuevas peticiones son lentas, es importante activar el *keep-alive* de HTTP en el servidor web.

source: OSTree supports something called static deltas. These are single files in the repo that contains all the data needed to go between two revisions (or from nothing to a revision). Creating such deltas will take up more space on the server, but will make downloads much faster. This can be done with the ``build-update-repo --generate-static-deltas`` option.
es: OSTree tiene una característica llamada deltas estáticos. Estos son archivos únicos en el repositorio que contienen todos los datos necesarios para pasar de una revisión a otra (o de nada a una revisión). La creación de estos deltas tomará más espacio en el servidor, pero hará que las descargas sean mucho más rápidas. Esto puede hacerse con la opción ``build-update-repo --generate-static-deltas``.

source: GPG signatures
es: Firmas GPG

source: OSTree uses GPG to verify the identity of repositories. This requires that every commit to a repository uses a GPG signature, as well as when repository summary files are modified.
es: OSTree usa GPG para verificar la identidad de los repositorios. Esto requiere que todos los commits a un repositorio usen una firma GPG, así también como cuando se modifique el archivo sumario de un repositorio.

source: To do this, a GPG key needs to be passed to the ``build-update-repo`` and ``build-export`` commands, as well as ``flatpak-builder`` if it is being used to modify or create a repository. (If you don't already have a key, `it is easy to generate one <https://help.github.com/articles/generating-a-new-gpg-key/>`_.) For example::
es: Para hacerlo, se debe pasar una clave GPG a los comandos ``build-update-repo`` y ``build-export``, así como también a ``flatpak-builder`` si está siendo usado para modificar o crear un repositorio. Si todavía no tiene una clave, `es fácil generar una <https://help.github.com/articles/generating-a-new-gpg-key/>`_.) Por ejemplo::

source: Here ``--gpg-homedir`` is optional, and allows specifying the home directory of the key to be used.
es: Aquí ``--gpg-homedir`` es opcional, y permite especificar el directorio home de la clave a ser usada.

source: Though it generally isn't recommended, it is possible to disable GPG verification of OSTree repositories. To do this, the ``--no-gpg-verify`` option can be used when a remote is added. GPG verification can also be disabled on an existing remote using ``flatpak remote-modify``.
es: Si bien en general no se recomienda, es posible desactivar la verificación GPG de los repositorios OSTree. Para hacerlo, la opción ``--no-gpg-verify`` se puede usar cuando se agregue un remoto. La verificación GPG también puede desactivarse en un remoto existente usando ``flatpak remote-modify``.

source: Note that it is necessary to become root in order to update a remote that does not have GPG verification enabled.
es: Notar que es necesario convertirse en root para poder actualizar un remoto que no tenga verificación de GPG activada.

source: Referring to repositories
es: Referenciar repositorios

source: A convenient way to point users to the repository containing your application is to provide a ``.flatpakrepo`` file that they can download and install. To install a ``.flatpakrepo`` file manually, use the command::
es: Una forma conveniente de dirigir a los usuarios al repositorio que contiene su aplicación es proporcionando un archivo ``.flatpakrepo`` que puedan descargar e instalar. Para instalar un archivo ``.flatpakrepo`` manualmente, use el comando::

source: A typical ``.flatpakrepo`` file looks like this::
es: Un archivo ``.flatpakrepo`` típico luce así::

source: If your repository contains just a single application, it may be more convenient to use a .flatpakref file instead, which contains enough information to add the repository and install the application at the same time. To install a ``.flatpakref`` file manually, use the command::
es: Si su repositorio contiene una sola aplicación, puede ser más conveniente usar un archivo .flatpakref, que contenga la información suficiente para agregar el repositorio e instalar la aplicación al mismo tiempo. Para instalar un ``.flatpakref`` manualmente, usar el comando::

source: A typical ``.flatpakref`` file looks like this::
es: Un archivo ``.flatpakref`` típico luce así::

source: Note that the GPGKey key in these files contains the base64-encoded GPG key, which you can get with the following command::
es: Notar que la clave GPGKey en estos archivos contienen la clave GPG codificada en base64, la cual puede obtener con el siguiente comando::

source: Single-file bundles
es: Empaquetado en un solo archivo

source: Hosting a repository is the preferred way to distribute an application, but sometimes a single-file bundle that you can make available from a website or send as an email attachment is more convenient. Flatpak supports this with the ``build-bundle`` and ``build-import-bundle`` commands to convert an application in a repository to a bundle and back::
es: Hospedar un repositorio es la forma preferida de distribuir una aplicación, pero a veces un solo archivo autocontenido que se pueda hacer disponible en un sitio web o enviado adjunto en un email es más conveniente. Flatpak brinda capacidad para esto con los comandos ``build-bundle`` y ``build-import-bundle`` que convierten una aplicación en un repositorio en un archivo autocontenido y viceversa::

source: For example, to create a bundle named `dictionary.flatpak` containing the GNOME dictionary app from the repository at ~/repositories/apps, run::
es: Por ejemplo, para crear un archivo autocontenido llamado `dictionary.flatpak` que contenga a la aplicación Diccionario de GNOME desde un repositorio ubicado en ~/repositories/apps, correr::

source: To import the bundle into a repository on another machine, run::
es: Para importar el autocontenido en un repositorio de otra máquina, correr::

source: Note that bundles have some drawbacks, compared to repositories. For example, distributing updates is much more convenient with a hosted repository, since users can just run ``flatpak update``.
es: Notar que los autocontenidos tienen algunas desventajas comparados con los repositorios. Por ejemplo, es mucho más conveniente distribuir actualizaciones con un repositorio hospedado, dado que los usuarios simplemente necesitan correr ``flatpak update``.
