Repository: Acidburn0zzz/flatpak-docs
Catalog: po/*/LC_MESSAGES/flatpak-builder.po
Languages: es

source: Most applications require additional dependencies that aren't provided by their runtimes. Flatpak allows these dependencies to be bundled as part of the application itself. In order to do this, each dependency must be built inside the application build directory. The ``flatpak-builder`` tool automates this multi-step build process, making it possible to build all application modules with a single command.
es: La mayoría de las aplicaciones requieren dependencias adicionales que no están provistas por los runtimes. Flatpak permite que estas dependencias se agrupen como parte de la aplicación misma. Para hacer esto, cada dependencia debe ser construida dentro del directorio build de la aplicación. La herramienta ``flatpak-builder`` automatiza este proceso que suele tomar múltiples pasos, haciendo posible construir todos los módulos de la aplicación con un solo comando.

source: flatpak-builder expects modules to be built in the standard manner by following what is called the `Build API <https://github.com/cgwalters/build-api/>`_. This requires modifying modules to follow the build API, if they don't already.
es: flatpak-builder espera módulos que se construyen de la manera estándar siguiendo lo que se conoce como la `API de construcción <https://github.com/cgwalters/build-api/>`_. Esto requiere modificar los módulos para que sigan dicha API, si es que aún no lo hacen.

source: All json entities are explained in the man page of ``flatpak-builder``.
es: Todas las entidades json están explicadas en la página man de ``flatpak-builder``.

source: Manifests
es: Manifiestos

source: The input to flatpak-builder is a JSON file that describes the parameters for building an application, as well as each of the modules to be bundled. This file is called the manifest. Module sources can be of several types, including ``.tar`` or ``.zip`` archives, Git or Bzr repositories, patch files or shell commands that are run.
es: La entrada de flatpak-builder es un archivo JSON que describe los parámetros para construir una aplicación, así como los de cada módulo a ser agrupado. Este archivo se llama el manifiesto. Las fuentes de los módulos pueden ser de varios tipos, incluyendo archivadores ``.tar`` o ``.zip``, repositorios Git or Bzr, archivos de parches o comandos de shell que se corren.

source: The GNOME Dictionary manifest is short, because the only module is the application itself::
es: El manifiesto del Diccionario de GNOME es corto, porque el único módulo que contiene es la aplicación misma::

source: As can be seen, this manifest includes basic information about the application before specifying a single .tar file to be downloaded and built. More complex manifests include a sequence of modules.
es: Como se puede ver, este manifiesto incluye la información básica sobre la aplicación antes de especificar un único archivo .tar a ser descargado y construido. Manifiestos más complejos incluyen una secuencia de módulos.

source: Cleanup
es: Limpieza

source: After building has taken place, flatpak-builder performs a cleanup phase. This can be used to remove headers and development documentation, among other things. Two properties in the manifest file are used for this. First, a list of filename patterns can be included::
es: Luego de la construcción, flatpak-builder procede a la fase de limpieza. Esta puede ser usada para eliminar encabezados y documentación de desarrollo, entre otras cosas. Dos propiedades del archivo manifiesto son usadas para esto. Primero, se puede incluir una lista de patrones de nombres de archivos::

source: The second cleanup property is a list of commands that are run during the cleanup phase::
es: La segunda propiedad es una lista de comandos que se corren durante la fase de limpieza::

source: Cleanup properties can be set on a per-module basis, in which case only filenames that were created by that particular module will be matched.
es: Las propiedades de limpieza también pueden asignarse a nivel de módulos, en cuyo caso la comparación se hará sólo para los archivos que fueron creados para ese módulo en particular.

source: File renaming
es: Renombrado de archivos

source: Files that are exported by a flatpak must be prefixed using the application ID. If an application's source files are not named using this convention, flatpak-builder allows them to be renamed as part of the build process. To rename application icons, desktop files and AppData files, use the ``rename-icon``, ``rename-desktop-file`` and ``rename-appdata`` properties.
es: Los archivos que son exportados por un flatpak deben tener como prefijo el ID de la aplicación. Si los archivos fuentes de una aplicación no están nombrados usando esta convención, flatpak-builder permite renombrarlos como parte del proceso de construcción. Para renombrar iconos de la aplicación, archivos de escritorio y archivos AppData, use las propiedades ``rename-icon``, ``rename-desktop-file`` y ``rename-appdata``.

source: Splitting things up
es: Separando los tantos

source: By default, flatpak-builder splits off translations and debug information into separate .Locale and .Debug extensions. These 'standard' extension points are then added to the application's metadata file. You can turn this off with the ``separate-locales`` and ``no-debuginfo`` keys, but there shouldn't be any reason for it.
es: Por defecto, flatpak-builder separa la información de traducciones y *debug* en extensiones .Locale and .Debug. Estos puntos de extensión "estándar" son luego agregados al archivo de metadatos de la aplicación. Puede desactivar esto con las claves ``separate-locales`` y ``no-debuginfo``, pero no debería haber razón alguna para hacerlo.

source: When flatpak-builder exports the build into a repository, it automatically includes the .Locale and .Debug extensions. If you do the exporting manually, don't forget to include them.
es: Cuando flatpak-builder exporta la construcción a un repositorio, automáticamente incluye las extensiones .Locale and .Debug. Si hace la exportación de forma manual, no olvide incluirlas.

source: Example
es: Ejemplo

source: To try flatpak-builder yourself, create a file called ``org.gnome.Dictionary.json`` and paste the Dictionary manifest JSON from above into it. Then run the following command::
es: Para probar flatpak-builder usted mismo, cree un archivo llamado ``org.gnome.Dictionary.json`` y pegue el manifiesto JSON del Diccionario de arriba. Luego corra el siguiente comando::

source: This will:
es: Esto hará lo siguiente:

source: Create a new directory called dictionary2 (equivalent to using `flatpak build-init`)
es: Crear un nuevo directorio llamado dictionary2 (equivalente a usar `flatpak build-init`).

source: Download and verify the Dictionary source code
es: Descargar y verificar el código fuente de Dictionario.

source: Build and install the source code, using the SDK rather than the host system
es: Construir e instalar el código fuente, usando el SDK en lugar del sistema host.

source: Finish the build, by setting permissions (in this case giving access to X and the network)
es: Finalizar la construcción, asignando permisos (en este caso dando acceso a X y a la red).

source: Create a new repository called repo (if it doesn't exist) and export the resulting build into it
es: Crear un nuevo repositorio llamado repo (si aún no existe) y exportar el resultado de la construcción dentro del mismo.

source: flatpak-builder will also do some other useful things, like creating a separately installable debug runtime (called `org.gnome.Dictionary.Debug` in this case) and a separately installable translation runtime (called ``org.gnome.Dictionary.Locale``).
es: flatpak-builder también hará algunas otras cosas, como crear un runtime de debug separado (llamado `org.gnome.Dictionary.Debug` en este caso) y un runtime de traducción separado (llamado ``org.gnome.Dictionary.Locale``).

source: If you completed the tutorial in `Building Simple Apps <building-simple-apps.html>`_, you can update the Dictionary application you installed with the new version that was built and exported by flatpak-builder::
es: Si ha completado el tutorial en `Construcción de apps simples <building-simple-apps.html>`_, puede actualizar la aplicación instalada con la nueva versión que acaba de construir y exportar con flatpak-builder::

source: To check that the application has been successfully updated, you can compare the sha256 commit of the installed app with the commit ID that was printed by flatpak-builder::
es: Para comprobar que la aplicación ha sido actualizada con éxito, puede comparar el commit sha256 de la aplicación instalada con el ID del commit que imprimió flatpak-builder::

source: And finally, you can run the new version of the Dictionary app::
es: Y finalmente, puede correr la nueva versión del app Diccionario::

source: Example manifests
es: Manifiestos de ejemplo

source: A `complete manifest for GNOME Dictionary built from Git <https://git.gnome.org/browse/gnome-dictionary/tree/data/org.gnome.Dictionary.json>`_ is available, in addition to `manifests for a range of other GNOME applications <https://git.gnome.org/browse/gnome-apps-nightly/tree/>`_.
es: Hay disponible un `manifiesto completo para el Diccionario de GNOME construido desde Git <https://git.gnome.org/browse/gnome-dictionary/tree/data/org.gnome.Dictionary.json>`_, además de `manifiestos para un amplio rango de otras aplicaciones de GNOME <https://git.gnome.org/browse/gnome-apps-nightly/tree/>`_.
