Repository: Acidburn0zzz/flatpak-docs
Catalog: po/*/LC_MESSAGES/getting-setup.po
Languages: es

source: Getting Setup
es: Preparación

source: Getting setup to build Flatpaks is quick and easy. First, it is necessary to have the ``flatpak`` and ``flatpak-builder`` packages installed on your system. These are available for most distributions, and the Flatpak website provides `details on how to get them <http://flatpak.org/getting.html>`_.
es: Prepararse para construir flatpaks es rápido y sencillo. Primero, es necesario tener instalados en el sistema los paquetes ``flatpak`` y ``flatpak-builder``. Están disponibles en la mayoría de las distribuciones, y el sitio web de Flatpak proporciona los `detalles para obtenerlos <http://flatpak.org/getting.html>`_.

source: Once flatpak has been installed, it is necessary to pick a runtime and install it, along with the matching SDK.
es: Una vez que flatpak ha sido instalado, es necesario elegir un runtime e instalarlo, junto con el SDK correspondiente.

source: Installing an SDK
es: Instalación de un SDK

source: An SDK is a special type of runtime that is used to build applications. Typically, an SDK is paired with a runtime that will be used by the application at runtime. For example the GNOME 3.22 SDK is used to build applications that use the GNOME 3.22 runtime.
es: Un SDK es un tipo especial de runtime que se usa para construir aplicaciones. Típicamente, un SDK está apareado con un runtime que será usado por la aplicación al momento de ser lanzada. Por ejemplo el SDK GNOME 3.22 SDK se usa para construir aplicaciones que se lanzan sobre el runtime GNOME 3.22.

source: The Flatpak website provides a `list of the available runtimes <http://flatpak.org/runtimes.html>`_. Once you have decided which one to use, getting setup is just a matter of installing it and its SDK.
es: El sitio de Flatpak proporciona una `lista de los runtimes disponibles <http://flatpak.org/runtimes.html>`_. Una vez que haya decidido cual usar, prepararlo es sólo una cuestión de instalarlo junto con su SDK.

source: The examples in the rest of the Flatpak documentation use the GNOME 3.22 runtime and SDK. If you haven't installed these already, download the repository GPG key and then add the repository that contains the runtime and SDK::
es: Los ejemplos en el resto de la documentación de Flatpak usan el runtime y el SDK de GNOME 3.22. Si todaviá no los ha instalado, descargue la clave GPG del repositorio y luego agregue el repositorio que contiene el runtime y el SDK::

source: You can now download and install the runtime and SDK::
es: Ahora puede descargar e instalar el runtime y el SDK::

source: This same procedure can be used to install any other runtime and SDK.
es: El mismo procedimiento puede usarse para instalar cualquier otro runtime y SDK.

source: Taking a look around
es: Echando un vistazo

source: If this is the first time you've used Flatpak, it is a good time to try installing an application and having a look 'under the hood'. To do this, you need to add a repository that contains applications. We can do this using the gnome-apps repository to install gedit::
es: Si esta es la primera vez que usa Flatpak, es un buen momento para intentar instalar una aplicación y echar un vistazo "bajo la alfombra". Para hacer esto, necesita instalar un repositorio que contenga aplicaciones. Podemos hacerlo usando el repositorio gnome-apps para instalar gedit::

source: You can now use the following command to get a shell in the 'devel sandbox'::
es: Ahora puede usar el siguiente comando para obtener un shell en 'devel sandbox'::

source: This gives you an environment which has the application bundle mounted in ``/app``, and the SDK it was built against mounted in ``/usr``. You can explore these two directories to see what a typical flatpak looks like, as well as what is included in the SDK.
es: Esto abre un entorno que tiene al paquete de la aplicación montado en ``/app``, y al SDK con el que fue construida montado en ``/usr``. Puede explorar estos dos directorios para ver cómo luce un típico flatpak, y también qué incluye el SDK.
