Repository: Acidburn0zzz/flatpak-docs
Catalog: po/*/LC_MESSAGES/introduction.po
Languages: es

source: Introduction to Flatpak
es: Introducción a Flatpak

source: Flatpak is a technology for building, distributing, installing and running applications. It is primarily targeted at the Linux desktop, although it can also be used as the basis for application distribution in other contexts, such as embedded systems.
es: Flatpak es una tecnología para construir, distribuir, instalar, y lanzar aplicaciones. Está orientada principalmente al escritorio Linux, aunque también puede ser usada como base para la distribución de aplicaciones en otros contextos, tales como sistemas embebidos.

source: Flatpak has been designed and implemented with a number of goals:
es: Flatpak ha sido diseñado e implementado con una cantidad de objetivos:

source: Allow applications to be installed on any Linux distribution.
es: Permitir que las aplicaciones puedan ser instaladas en cualquier distribución Linux.

source: Provide consistent environments for applications, to facilitate testing and reduce bugs.
es: Proporcionar entornos consistentes a las aplicaciones, para facilitar las pruebas y reducir errores.

source: Decouple applications from the operating system, so that applications don't depend on specific versions of each distribution.
es: Desacoplar las aplicaciones del sistema operativo, para que no dependan de versiones específicas de cada distribución.

source: Allow applications to bundle their own dependencies, so that they can use libraries that aren't provided by a Linux distribution, and so they can depend on specific versions or even patched versions of a library.
es: Permitir que las aplicaciones agrupen sus propias dependencias, de forma que puedan usar bibliotecas que no estén provistas por una distribución de Linux, y así puedan depender de versiones específicas o incluso versiones emparchadas de alguna biblioteca.

source: Increase the security of Linux desktops, by isolating applications in sandboxes.
es: Incrementar la seguridad de los escritorios Linux, aislando aplicaciones en *sandboxes*.

source: Flatpak makes it easy to take advantage of these features. If you haven't already, it is recommended that you try the `hello world <http://flatpak.org/hello-world.html>`_ example, as a way of getting started.
es: Flatpak hace que sea fácil sacar partido de estas características. Si aún no lo ha hecho, se recomienda que pruebe el ejemplo de `hola mundo <http://flatpak.org/hello-world.html>`_ como una forma de ponerse en marcha.

source: More information about Flatpak can be found on `flatpak.org <http://flatpak.org/>`_.
es: Puede encontrar más información sobre Flatpak en `flatpak.org <http://flatpak.org/>`_.

source: How it works
es: Cómo funciona

source: Flatpak can be understood through a small number of key concepts. These also help to explain how it differs from traditional software packages.
es: Flatpak puede entenderse a través de un pequeño número de conceptos clave. Éstos también ayudan a explicar la diferencia con los paquetes de software tradicional.

source: Runtimes provide the basic dependencies that are used by applications. Various runtimes are available, from more minimal (but more stable) Freedesktop runtimes, to larger runtimes produced by desktops like GNOME or KDE. (The `runtimes page <http://flatpak.org/runtimes.html>`_ on flatpak.org provides an overview of the runtimes that are currently available.)
es: Los *runtimes* proporcionan las dependencias básicas que las aplicaciones usan. Hay varios runtimes disponibles, desde el más mínimo (pero más estable) Freedesktop, a runtimes más grandes producidos por escritorios como GNOME o KDE. La `página de runtimes <http://flatpak.org/runtimes.html>`_ en flatpak.org proporciona una vista general de los runtimes disponibles actualmente.

source: Each application must be built against a runtime, and this runtime must be installed on a host system in order for the application to run. Users can install multiple different runtimes at the same time, including different versions of the same runtime.
es: Cada aplicación debe ser construida contra un runtime, y este runtime debe ser instalado en el sistema *host* para que la aplicación se pueda lanzar. Los usuarios pueden tener instalados múltiples runtimes diferentes al mismo tiempo, inclusive distintas versiones del mismo runtime.

source: Each runtime can be thought of as a ``/usr`` filesystem. Indeed, when an application is run, its runtime is mounted at ``/usr``.
es: Cada runtime puede pensarse como un sistema de archivos ``/usr``. De hecho, cuando se lanza una aplicación, su runtime está montado en ``/usr``.

source: Bundled libraries
es: Bibliotecas agrupadas

source: If an application requires any dependencies that aren't in its runtime, they can be bundled along with the application itself. This allows applications to use dependencies that aren't available in a distribution, or to use a different version of a dependency from the one that's installed on the host.
es: Si una aplicación requiere alguna dependencia que no esté en su runtime, puede ser agrupada junto con la aplicación misma. Esto permite que las aplicaciones usen dependencias que no están disponibles en la distribución, o que usen una dependencia en una versión distinta de la instalada en el host.

source: SDKs (Software Developer Kits)
es: SDKs (Kits de desarrollo de software)

source: An SDK is a runtime that includes the 'devel' parts which are not needed at runtime, such as build and packaging tools, header files, compilers and debuggers. Each application is built against an SDK, which is paired with a runtime (this is the runtime that will be used by the application at runtime).
es: Un SDK es un runtime que incluye las partes 'devel' que no son necesarias al momento de lanzar la aplicación, tales como herramientas de construcción y empaquetado, archivos de cabecera, compiladores y *debuggers*. Cada aplicación se construye contra un SDK, que está apareado a un runtime. Este es el runtime que será usado por la aplicación al ser lanzada.

source: Extensions
es: Extensiones

source: An extension is an optional add-on for a runtime or application. They are most commonly used to split out translations and debug info from runtimes. For example, ``org.freedesktop.Platform.Locale`` can be added to the ``org.freedesktop.Platform`` runtime in order to add translations.
es: Una extensión es un agregado opcional a un runtime o aplicación. Son más comúnmente usados para separar de los runtimes a las traducciones y a la información de *debug*. Por ejemplo, ``org.freedesktop.Platform.Locale`` puede agregarse al runtime ``org.freedesktop.Platform`` para sumar traducciones.

source: With Flatpak, each app is built and run in an isolated environment. By default, the application can only 'see' itself and its runtime. Access to user files, network, graphics sockets, subsystems on the bus and devices have to be explicitly granted. (As will be described later, Flatpak provides several ways to do this.) Access to other things, such as other processes, is deliberately not possible.
es: Con Flatpak, cada app es construida y lanzada en un entorno aislado. Por defecto, la aplicación sólo puede "ver" dos cosas: a sí misma y a su runtime. Se debe garantizar explícitamente el acceso a los archivos de usuario, la red, los *sockets* gráficos, subsistemas del bus y dispositivos. Como se describirá más adelante, Flatpak proporciona varias formas de hacerlo. El acceso a otras cosas, como por ejemplo a otros procesos, es deliberadamente imposible.

source: The flatpak command
es: El comando flatpak

source: ``flatpak`` is the command that is used to install, remove and update runtimes and applications. It can also be used to view what is currently installed, and has commands for building and distributing application bundles. ``flatpak --help`` provides a full list of available commands.
es: ``flatpak`` es el comando que se usa para instalar, desinstalar y actualizar runtimes y aplicaciones. También puede usarse para ver qué está instalado actualmente, y tiene comandos para construir y distribuir paquetes de aplicaciones. ``flatpak --help`` proporciona una lista completa de los comandos dispobibles.

source: Most flatpak commands are performed system-wide by default. To perform a command for the current user only, use the ``--user`` option. This allows runtimes and application bundles to be installed per-user, for instance.
es: La mayoría de los comandos flatpak son realizados a nivel de sistema por defecto. Para realizar un comando sólo para el usuario actual, use la opción ``--user``. Esto permite, por ejemplo, que los runtimes y los paquetes de aplicaciones sean instaladas por cada usuario.

source: For more information on flatpak commands, see the :doc:`command-reference`
es: Para más información sobre los comandos de flatpak, vea la :doc:`command-reference`

source: Identifiers
es: Identificadores

source: Flatpak identifies each application, runtime and SDK using a unique name, which is sometimes used as part of a name/arch/branch triple.
es: Flatpak identifica cada aplicación, runtime y SDK usando un nombre único, que a veces se emplea como parte de una tripleta nombre/arquitectura/rama.

source: Naming
es: Nombre

source: Flatpak names take the form of an inverse DNS address, such as ``com.company.App``. The final segment of this address is the object's name, and the preceding part is the domain that it belongs to. In order to prevent name conflicts, this domain should correspond to a DNS registered address. This means using a domain from a website, either for an application or an organization. For instance, if application ``App`` has its own website at ``app.com``, its Flatpak name would be ``com.app.App``. Multiple applications can belong to the same domain, such as ``org.organization.App1`` and ``org.organization.App2``.
es: Los nombres de Flatpak toman la forma de una dirección de DNS inversa, tal como ``com.compañia.App``. El segmento final de esta dirección es el nombre del objeto, y la parte precedente es el dominio al que pertenece. Para poder prevenir conflictos entre nombres, este dominio debe corresponder a una dirección de DNS registrada. Esto significa que se debe usar el dominio de un sitio web, ya sea de una aplicación o de una organización. Por ejemplo, si la aplicación ``App`` tiene su propio sitio en ``app.com``, su nombre Flatpak sería ``com.app.App``. Múltiples aplicaciones pueden pertenecer al mismo dominio, tales como ``org.organización.App1`` y ``org.organización.App2``.

source: If you do not have a registered domain for your application, it is easy to use a third party website to get one. For example, Github allows the creation of personal pages that can be used for this purpose. Here, a personal namespace of ``name.github.io`` could be used as the basis of application identifier ``io.github.name.App``.
es: Si no cuenta con un dominio registrado para su aplicación, se puede usar un sitio web de terceros para obtener uno. Por ejemplo, Github permite la creación de páginas personales que pueden usarse para este propósito. En este caso, el espacio de nombres ``nombre.github.io`` puede usarse como la base de un identificador de aplicación ``io.github.nombre.App``.

source: If an application provides a D-Bus service, the D-Bus service name is expected to be the same as the application name.
es: Si la aplicación proporciona un servicio de D-Bus, se espera que el nombre del servicio de D-Bus sea el mismo que el nombre de la aplicación.

source: Identifier triples
es: Tripleta identificadora

source: Many flatpak commands only require the name of an application, runtime or SDK. However, in some circumstances it is also necessary to specify the architecture and branch (branches allow a particular version to be specified). This is done using a name/arch/branch triple. For example: ``org.gnome.Sdk/x86_64/3.14`` or ``org.gnome.Builder/i386/master``.
es: Muchos comandos de flatpak sólo requieren el nombre de una aplicación, runtime o SDK. Sin embargo, en algunas circunstancias también es necesario especificar la arquitectura y la rama. Las ramas permiten especificar una versión en particular. Esto se hace usando la tripleta nombre/arquitectura/rama. Por ejemplo: ``org.gnome.Sdk/x86_64/3.14`` o ``org.gnome.Builder/i386/master``.

source: Under the hood
es: Bajo la alfombra

source: Flatpak uses a number of pre-existing technologies. It generally isn't necessary to be familiar with these in order to use Flatpak, although in some cases it might be useful. They include:
es: Flatpak usa una cantidad de tecnologías preexistentes. En general no es necesario estar familiarizado con ellas para poder usar Flatpak, pero en algunos casos esto podría ser útil. Incluyen:

source: The `bubblewrap <https://github.com/projectatomic/bubblewrap>`_ utility from `Project Atomic <http://www.projectatomic.io/>`_, which lets unprivileged users set up and run containers, using kernel features such as:
es: La utilidad `bubblewrap <https://github.com/projectatomic/bubblewrap>`_ del `Project Atomic <http://www.projectatomic.io/>`_, que hace que los usuarios sin privilegios puedan configurar y correr contenedores, usando características del *kernel* tales como:

source: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ to set up cgroups for sandboxes
es: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ para configurar cgroups para sandboxes

source: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, a well-established way to provide high-level APIs to applications
es: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, una forma bien establecida de proporcionar APIs de alto nivel a las aplicaciones.

source: The OCI format from the `Open Container Initiative <https://www.opencontainers.org/>`_, as a convenient transport format for single-file bundles
es: El formato OCI de la `Open Container Initiative <https://www.opencontainers.org/>`_, como un formato conveniente de transporte para paquetes de un solo archivo.

source: The `OSTree <https://ostree.readthedocs.io/en/latest/>`_ system for versioning and distributing filesystem trees
es: El sistema `OSTree <https://ostree.readthedocs.io/en/latest/>`_ para el versionado y la distribución de árboles de archivos de sistema.

source: `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_ metadata, to allow Flatpak applications to show up nicely in software-center applications
es: Metadatos `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_, para permitir que las aplicaciones flatpak se vean bien en aplicaciones administradoras de software.
