Repository: Acidburn0zzz/flatpak-docs
Catalog: po/*/LC_MESSAGES/working-with-the-sandbox.po
Languages: es

source: Working with the Sandbox
es: Trabajar con el Sandbox

source: One of Flatpak's main goals is to increase the security of desktop systems by isolating applications from one another. This is done using sandboxing and it means that, by default, a Flatpak has extremely limited access to the host environment. This includes:
es: Uno de los objetivos principales de Flatpak es incrementar la seguridad en los sistemas de escritorio, aislando a las aplicaciones de las demás. Esto se logra usando sandboxing y significa que, por defecto, un Flatpak tiene un acceso extremadamente limitado al entorno del host. Esto incluye:

source: No access to any host files except the runtime, the app and ``~/.var/app/$APPID``. Only the last of these is writable.
es: Sin acceso a ningún archivo del host con excepción del runtime, de la app y de ``~/.var/app/$APPID``. Sólo se permite acceso de escritura al último de estos.

source: No access to the network.
es: Sin acceso a la red.

source: No access to any device nodes (apart from ``/dev/null``, etc).
es: Sin acceso a ningún nodo de dispositivo (aparte de ``/dev/null``, etc).

source: No access to processes outside the sandbox.
es: Sin acceso a los procesos por fuera del sandbox.

source: Limited syscalls. For instance, apps can't use nonstandard network socket types or ptrace other processes.
es: Llamadas al sistema limitadas. Por ejemplo, las apps no pueden usar tipos de socket de red no estándar, o hacer ptrace de otros procesos.

source: Limited access to the session D-Bus instance - an app can only own its own name on the bus.
es: Acceso limitado a la instancia del D-Bus de sesión - una app puede ser dueña sólo su propio nombre en el bus.

source: No access to host services like X, system D-Bus, or PulseAudio.
es: Sin acceso a los servicios del host como X, el D-Bus del sistema, o PulseAudio.

source: Most applications will need access to some of these resources in order to be useful, and Flatpak provides a number of ways to give an application access to them.
es: La mayoría de las aplicaciones necesitarán acceso a algunos de estos recursos para poder ser usadas, y Flatpak proporciona una cantidad de formas de dar a una aplicación acceso a los mismos.

source: While there are no restrictions on which sandbox permissions an application can use, as good practice, it is recommended to use the minimum number of as permissions possible. Certain permissions, such as blanket access to the system bus (using the ``--socket=system-bus`` option) are strongly discouraged.
es: Si bien no hay restricciones a cuáles permisos del sandbox una aplicación puede acceder, como buena práctica, se recomienda usar el mínimo número de permisos posible. Ciertos permisos, tales como el acceso total al bus del sistema (usando la opción ``--socket=system-bus`` ) deberían ser evitados a toda costa.

source: Configuring sandbox permissions
es: Configurar los permisos del sandbox

source: Using the ``build-finish`` command is the simplest way to configure sandbox permissions. As was seen in a previous example, this can be used to add access to graphics sockets and the network::
es: Usar el comando ``build-finish`` es la manera más simple de configurar los permisos del sandbox. Como se vio en un ejemplo anterior, esto puede ser usado para dar acceso a los sockets de gráficos y a la red::

source: These arguments translate into several properties in the application's metadata file::
es: Estos argumentos se traducen a varias propiedades dentro del archivo de metadatos de la aplicación::

source: build-finish allows a whole range of resources to be added to an application. These options can also be passed to flatpak-builder as ``finish-args`` properties.
es: build-finish permite agregar un amplio rango de recursos en una aplicación. Estas opciones también pueden pasarse a flatpak-builder como propiedades ``finish-args``.

source: The table at the bottom of this page provides an overview of many sandbox permissions. The full list can also be viewed using ``flatpak build-finish --help``.
es: La tabla de abajo proporciona una vista general de varios permisos del sandbox. La lista completa también puede verse usando ``flatpak build-finish --help``.

source: Until a sandbox-compatible backend is available, access to dconf needs to be enabled using the following options::
es: Hasta que exista un backend compatible con el sandbox, el acceso a dconf necesita activarse usando las siguientes opciones::

source: Portals
es: Portales

source: Portals are a mechanism through which applications can interact with the host environment from within a sandbox. In this way, they give additional abilities to interact with data, files and services without the need to add sandbox permissions.
es: Los portales son un mecanismo a través del cual las aplicaciones pueden interactuar con el entorno del host desde adentro de un sandbox. De esta forma, se dan utilidades adicionales para interactuar con datos, archivos y servicios sin necesidad de agregar permisos de sandbox.

source: Interface toolkits can implement transparent support for portals. If an application uses one of these toolkits, there is no additional work required to access them.
es: Los *toolkits* de interfaces pueden implementar soporte para portales. Si una aplicación usa uno de estos toolkits, no se requiere ningún trabajo adicional para acceder a los mismos.

source: Examples of capabilities that can be accessed through portals include:
es: Ejemplos de capacidades a las que se puede acceder a través de portales incluyen:

source: Inhibit the user session from ending, suspending, idling or getting switched away
es: Inhabilitar la sesión del usuario para cerrarla, suspenderla, o cambiar de usuario.

source: Network status information
es: Información del estado de la red

source: Notifications
es: Notificaciones

source: Open a URI
es: Abrir una URI

source: Open files with a native file chooser dialog
es: Abrir archivos con un diálogo selector de archivos nativo

source: Printing
es: Imprimir

source: Screenshots
es: Tomar capturas de pantalla

source: Applications that aren't using a toolkit with support for portals can refer to the `xdg-desktop-portal API documentation <http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ for information on how to access them.
es: Las aplicaciones que no usen un toolkit con soporte para portales pueden dirigirse a la `documentación de la API de xdg-desktop-portal <http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ para información de cómo acceder a los mismos.

source: Overriding sandbox permissions
es: Sobreescribir los permisos del sandbox

source: When developing an application, it can sometimes be useful to override a Flatpak's sandbox configuration. There are several ways to do this. One is to override them using ``flatpak run``, which accepts the same parameters as ``build-finish``. For example, this will let the Dictionary application see your home directory::
es: Cuando se desarrolla una aplicación, puede ser útil sobreescribir la configuración de un sandbox de Flatpak. Hay varias maneras de hacerlo. Una es sobreescribirla usando ``flatpak run``, que acepta los mismos parámetros que ``build-finish``. Por ejemplo, esto hará que la aplicación Diccionario vea su directorio home::

source: ``flatpak override`` can also be used to permanently override an application's permissions::
es: También puede usarse ``flatpak override`` para sobreescribir permanentemente los permisos de una aplicación::

source: It is also possible to remove permissions using the same method. You can use the following command to see what happens when access to the filesystem is removed, for example::
es: Además es posible quitar permisos usando el mismo método. Puede usar el siguiente comando para ver qué ocurre si se elimina el acceso al sistema de archivos, por ejemplo::

source: Useful sandbox permissions
es: Permisos útiles del sandbox

source: Flatpak provides an array of options for controlling sandbox permissions. The following are some of the most useful:
es: Flatpak proporciona una lista de opciones para controlar los permisos del sandbox. Los siguientes son algunos de los más útiles:

source: Access all files
es: Acceso a todos los archivos

source: Access the home directory
es: Acceso al directorio home

source: Access the home directory, read-only
es: Acceso al directorio home, de sólo lectura

source: Access paths
es: Acceso a directorios específicos

source: Access the XDG download directory
es: Acceso al directorio Descargas de XDG

source: Undo some of the above
es: Hacer una excepción para alguna de las anteriores

source: Show windows using X11 [#f1]_
es: Mostrar ventanas usando X11 [#f1]_

source: OpenGL rendering
es: Renderizado OpenGL

source: Show windows using Wayland
es: Mostrar ventanas usando Wayland

source: Play sounds using PulseAudio
es: Reproducir sonidos usando PulseAudio

source: Access the network [#f2]_
es: Acceso a la red [#f2]_

source: Talk to a named service on the session bus
es: Comunicarse con un servicio por nombre en el bus de sesión

source: Talk to a named service on the system bus
es: Comunicarse con un servicio por nombre en el bus del sistema

source: Unlimited access to all of D-Bus
es: Acceso ilimitado a todos los D-Bus

source: Footnotes
es: Notas al pie

source: ``–share=ipc`` means that the sandbox shares IPC namespace with the host. This is not necessarily required, but without it the X shared memory extension will not work, which is very bad for X performance.
es: ``–share=ipc`` significa que cada sandbox comparte un espacio de nombres IPC con el host. Esto no es necesariamente requerido, pero sin esto no funcionará la memoria compartidad de la extensión X, lo cual es muy malo para la performance de X.

source: Giving network access also grants access to all host services listening on abstract Unix sockets (due to how network namespaces work), and these have no permission checks. This unfortunately affects e.g. the X server and the session bus which listens to abstract sockets by default. A secure distribution should disable these and just use regular sockets.
es: Dar acceso a la red también garantiza acceso a todos los servicios que escuchan en sockets abstractos de Unix (dada la forma en que los espacios de nombre de red funcionan), y estos no tienen chequeos de permisos. Esto desafortunadamente afecta por ej. al servidor X y al bus de la sesión, quienes escuchan en sockets abstractos por defecto. Una distribución segura debería desactivarlos y usar sólo sockets regulares.
